# VS Code extensions — installed by install.sh via `code --install-extension`.
# One extension ID per line. Lines starting with # and blank lines are ignored.

# Editing
vscodevim.vim

# Themes — "oxocarbon" is the active one (set in settings.json);
# fedora-gnome-light-dark is kept as an alternative.
nyoomengineering.oxocarbon-vscode
olifink.fedora-gnome-light-dark

# Python
ms-python.python
ms-python.debugpy
ms-python.vscode-python-envs

# Jupyter
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
